app/serializers/order_serializer.rb

  def pizzas
    self.object.pizzas.map do |pizza|
      {pizza_id: pizza.id,
      size: pizza.size,
      sauce: pizza.sauce.name,
      cheese: pizza.cheese.name,
      toppings: pizza.toppings.map {|topping| topping.name},
      gourmet_toppings: pizza.gourmet_toppings.map {|gourmet_topping| gourmet_topping.name}}
---
SELECT "pizzas".* FROM "pizzas" WHERE "pizzas"."order_id" = $1  [["order_id", 20]]
SELECT "cheeses".* FROM "cheeses" WHERE "cheeses"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
SELECT "sauces".* FROM "sauces" WHERE "sauces"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
SELECT "sizes".* FROM "sizes" WHERE "sizes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "toppings".* FROM "toppings" INNER JOIN "pizza_toppings" ON "toppings"."id" = "pizza_toppings"."topping_id" WHERE "pizza_toppings"."pizza_id" = $1  [["pizza_id", 6]]