app/serializers/user_serializer.rb

SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = $1  [["user_id", 20]]
---
  def orders
    self.object.orders.map do |order|