app/controllers/api/v1/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."name" = $1 LIMIT $2  [["name", "Jack"], ["LIMIT", 1]]
INSERT INTO "users" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Jack"], ["created_at", "2020-04-15 20:42:47.438663"], ["updated_at", "2020-04-15 20:42:47.438663"]]
---
    def show
        user = User.find_by(name: params[:id])
        unless (user)
            user = User.create(name: params[:id])