app/models/order.rb

SELECT "sizes".* FROM "sizes" WHERE "sizes"."name" = $1 LIMIT $2  [["name", "small"], ["LIMIT", 1]]
SELECT "sauces".* FROM "sauces" WHERE "sauces"."name" = $1 LIMIT $2  [["name", "tomato"], ["LIMIT", 1]]
SELECT "cheeses".* FROM "cheeses" WHERE "cheeses"."name" = $1 LIMIT $2  [["name", "feta"], ["LIMIT", 1]]
SELECT "toppings".* FROM "toppings" WHERE "toppings"."name" = $1 LIMIT $2  [["name", "broccoli"], ["LIMIT", 1]]
SELECT "toppings".* FROM "toppings" WHERE "toppings"."name" = $1 LIMIT $2  [["name", "celery"], ["LIMIT", 1]]
SELECT "gourmet_toppings".* FROM "gourmet_toppings" WHERE "gourmet_toppings"."name" = $1 LIMIT $2  [["name", "sundried tomatoes"], ["LIMIT", 1]]
INSERT INTO "pizzas" ("sauce_id", "cheese_id", "order_id", "size_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["sauce_id", 18], ["cheese_id", 12], ["order_id", 30], ["size_id", 6], ["created_at", "2020-04-16 22:18:02.797487"], ["updated_at", "2020-04-16 22:18:02.797487"]]
SELECT "toppings".* FROM "toppings" INNER JOIN "pizza_toppings" ON "toppings"."id" = "pizza_toppings"."topping_id" WHERE "pizza_toppings"."pizza_id" = $1  [["pizza_id", 16]]
INSERT INTO "pizza_toppings" ("pizza_id", "topping_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["pizza_id", 1], ["topping_id", 25], ["created_at", "2020-04-16 00:14:25.400339"], ["updated_at", "2020-04-16 00:14:25.400339"]]
INSERT INTO "pizza_gourmet_toppings" ("pizza_id", "gourmet_topping_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["pizza_id", 1], ["gourmet_topping_id", 11], ["created_at", "2020-04-16 00:14:25.425695"], ["updated_at", "2020-04-16 00:14:25.425695"]]
INSERT INTO "pizza_toppings" ("pizza_id", "topping_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["pizza_id", 13], ["topping_id", 51], ["created_at", "2020-04-16 22:24:40.583796"], ["updated_at", "2020-04-16 22:24:40.583796"]]
INSERT INTO "pizza_gourmet_toppings" ("pizza_id", "gourmet_topping_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["pizza_id", 16], ["gourmet_topping_id", 22], ["created_at", "2020-04-16 23:57:17.091235"], ["updated_at", "2020-04-16 23:57:17.091235"]]
---
    def makePizza(pizzas)
        pizzas.map do |pizza|
            size = Size.find_by(name: pizza['size'])
            sauce = Sauce.find_by(name: pizza['sauce'])
            cheese = Cheese.find_by(name: pizza['cheese'])

            toppings = pizza['toppings'].map{ |topping| Topping.find_by(name: topping) }

            gourmet_toppings = pizza['gourmet_toppings'].map{|gourmet_topping| GourmetTopping.find_by(name: gourmet_topping)}

            newPizza = Pizza.create(
            size: size,
            sauce: sauce,
            cheese: cheese,
            order_id: self.id)
            toppings.map {|topping| newPizza.toppings << topping}
            gourmet_toppings.map {|gourmet_topping| newPizza.gourmet_toppings << gourmet_topping}
            newPizza.save